
#### Terraform Plan
<details>
<summary>Expand</summary>

```
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/timovink/infra-shared/runs/run-btiFLVuAPssDTuwZ

Waiting for the plan to start...

Terraform v1.2.7
on linux_amd64
Initializing plugins and modules...
module.global_certificate["jackievink.ca"].aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-east-1:920122847127:certificate/b52c04e4-2275-4af0-b511-2b7856ae0c2a]
module.global_certificate["jackievink.com"].aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-east-1:920122847127:certificate/87bd463a-2474-40d3-814b-0446977549de]
module.global_certificate["timovink.com"].aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-east-1:920122847127:certificate/b5424589-49e4-41be-aed5-4e0387f5e995]
module.global_certificate["timovink.dev"].aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-east-1:920122847127:certificate/c37f96fe-c8d6-4cfa-a752-9b95610577d1]
module.global_certificate["timovink.ca"].aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-east-1:920122847127:certificate/c14c4e0f-400b-415b-bdf9-f5b38995b474]
module.global_certificate["timovink.app"].aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-east-1:920122847127:certificate/ed6e0edc-3d1a-41fd-900a-9342fcb09642]
module.dns["timovink.dev"].aws_route53_zone.this: Refreshing state... [id=Z09071302Y5GD83DY6NXW]
module.iam.aws_iam_group.administrators: Refreshing state... [id=administrators]
module.domain_redirects["timovink.dev"].aws_cloudfront_function.redirect: Refreshing state... [id=tv-sharedinfra-redirecttotimovinkdev]
module.dns["jackievink.ca"].aws_route53_zone.this: Refreshing state... [id=Z072293219D14M35KH4SZ]
module.iam.aws_iam_user.admin["deployer"]: Refreshing state... [id=deployer]
module.dns["jackievink.com"].aws_route53_zone.this: Refreshing state... [id=Z0213673ODBY64GY09TO]
module.domain_redirects["jackievink.com"].aws_cloudfront_function.redirect: Refreshing state... [id=tv-sharedinfra-redirecttojackievinkcom]
module.iam.aws_iam_user.admin["tvink"]: Refreshing state... [id=tvink]
module.dns["timovink.app"].aws_route53_zone.this: Refreshing state... [id=Z090672659X2JIXVUFX0]
module.dns["timovink.ca"].aws_route53_zone.this: Refreshing state... [id=Z08658091IB2VPYFZRTIS]
module.dns["timovink.com"].aws_route53_zone.this: Refreshing state... [id=ZFMCDCUJ8UCFO]
module.local_certificate["timovink.com"].aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-west-2:920122847127:certificate/9cf0da07-dfd0-4ffd-bc97-1d53a1c498cb]
module.local_certificate["jackievink.ca"].aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-west-2:920122847127:certificate/9b4e1e44-c855-46e9-94a1-6e98e725b685]
module.local_certificate["jackievink.com"].aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-west-2:920122847127:certificate/4b69412d-6c17-451c-bc83-3718bff09b26]
module.local_certificate["timovink.ca"].aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-west-2:920122847127:certificate/1d5e180f-aceb-44e7-93ff-d116ec4132dc]
module.local_certificate["timovink.dev"].aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-west-2:920122847127:certificate/bf00816d-2214-47e9-9533-e82bf38b838e]
module.budget.aws_budgets_budget.monthly: Refreshing state... [id=920122847127:terraform-20220612005833117900000001]
module.local_certificate["timovink.app"].aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-west-2:920122847127:certificate/a5f9fd0b-1fac-49d1-beba-b87ce4550483]
module.iam.aws_iam_group_policy_attachment.administrators: Refreshing state... [id=administrators-20220605021751233100000001]
module.iam.aws_iam_user_group_membership.admin["deployer"]: Refreshing state... [id=terraform-20220604232226591200000002]
module.iam.aws_iam_user_group_membership.admin["tvink"]: Refreshing state... [id=terraform-20220605021751235700000002]
module.global_certificate["jackievink.com"].aws_route53_record.validation["*.jackievink.com"]: Refreshing state... [id=Z0213673ODBY64GY09TO__456a894c8fe28e49ad6211de6dc5bc82.jackievink.com._CNAME]
module.global_certificate["jackievink.com"].aws_route53_record.validation["jackievink.com"]: Refreshing state... [id=Z0213673ODBY64GY09TO__456a894c8fe28e49ad6211de6dc5bc82.jackievink.com._CNAME]
module.global_certificate["timovink.app"].aws_route53_record.validation["timovink.app"]: Refreshing state... [id=Z090672659X2JIXVUFX0__898a605fd844d2311876cf17ced2654a.timovink.app._CNAME]
module.global_certificate["timovink.app"].aws_route53_record.validation["*.timovink.app"]: Refreshing state... [id=Z090672659X2JIXVUFX0__898a605fd844d2311876cf17ced2654a.timovink.app._CNAME]
module.global_certificate["timovink.ca"].aws_route53_record.validation["*.timovink.ca"]: Refreshing state... [id=Z08658091IB2VPYFZRTIS__78aa3e24a54e517847b5c3573be744e9.timovink.ca._CNAME]
module.global_certificate["timovink.ca"].aws_route53_record.validation["timovink.ca"]: Refreshing state... [id=Z08658091IB2VPYFZRTIS__78aa3e24a54e517847b5c3573be744e9.timovink.ca._CNAME]
module.global_certificate["timovink.com"].aws_route53_record.validation["*.timovink.com"]: Refreshing state... [id=ZFMCDCUJ8UCFO__d792b113bb70820125d76b1d48a01fcb.timovink.com._CNAME]
module.global_certificate["timovink.com"].aws_route53_record.validation["timovink.com"]: Refreshing state... [id=ZFMCDCUJ8UCFO__d792b113bb70820125d76b1d48a01fcb.timovink.com._CNAME]
module.global_certificate["timovink.dev"].aws_route53_record.validation["*.timovink.dev"]: Refreshing state... [id=Z09071302Y5GD83DY6NXW__aec79ae1e60595e5c546c99005405cb2.timovink.dev._CNAME]
module.global_certificate["timovink.dev"].aws_route53_record.validation["timovink.dev"]: Refreshing state... [id=Z09071302Y5GD83DY6NXW__aec79ae1e60595e5c546c99005405cb2.timovink.dev._CNAME]
module.global_certificate["jackievink.ca"].aws_route53_record.validation["jackievink.ca"]: Refreshing state... [id=Z072293219D14M35KH4SZ__937652936d27f2d693c725eb2355f79f.jackievink.ca._CNAME]
module.global_certificate["jackievink.ca"].aws_route53_record.validation["*.jackievink.ca"]: Refreshing state... [id=Z072293219D14M35KH4SZ__937652936d27f2d693c725eb2355f79f.jackievink.ca._CNAME]
module.local_certificate["timovink.ca"].aws_route53_record.validation["*.timovink.ca"]: Refreshing state... [id=Z08658091IB2VPYFZRTIS__78aa3e24a54e517847b5c3573be744e9.timovink.ca._CNAME]
module.local_certificate["timovink.ca"].aws_route53_record.validation["timovink.ca"]: Refreshing state... [id=Z08658091IB2VPYFZRTIS__78aa3e24a54e517847b5c3573be744e9.timovink.ca._CNAME]
module.local_certificate["timovink.com"].aws_route53_record.validation["*.timovink.com"]: Refreshing state... [id=ZFMCDCUJ8UCFO__d792b113bb70820125d76b1d48a01fcb.timovink.com._CNAME]
module.local_certificate["timovink.com"].aws_route53_record.validation["timovink.com"]: Refreshing state... [id=ZFMCDCUJ8UCFO__d792b113bb70820125d76b1d48a01fcb.timovink.com._CNAME]
module.local_certificate["timovink.dev"].aws_route53_record.validation["*.timovink.dev"]: Refreshing state... [id=Z09071302Y5GD83DY6NXW__aec79ae1e60595e5c546c99005405cb2.timovink.dev._CNAME]
module.local_certificate["timovink.dev"].aws_route53_record.validation["timovink.dev"]: Refreshing state... [id=Z09071302Y5GD83DY6NXW__aec79ae1e60595e5c546c99005405cb2.timovink.dev._CNAME]
module.local_certificate["jackievink.ca"].aws_route53_record.validation["jackievink.ca"]: Refreshing state... [id=Z072293219D14M35KH4SZ__937652936d27f2d693c725eb2355f79f.jackievink.ca._CNAME]
module.local_certificate["jackievink.ca"].aws_route53_record.validation["*.jackievink.ca"]: Refreshing state... [id=Z072293219D14M35KH4SZ__937652936d27f2d693c725eb2355f79f.jackievink.ca._CNAME]
module.local_certificate["jackievink.com"].aws_route53_record.validation["*.jackievink.com"]: Refreshing state... [id=Z0213673ODBY64GY09TO__456a894c8fe28e49ad6211de6dc5bc82.jackievink.com._CNAME]
module.local_certificate["jackievink.com"].aws_route53_record.validation["jackievink.com"]: Refreshing state... [id=Z0213673ODBY64GY09TO__456a894c8fe28e49ad6211de6dc5bc82.jackievink.com._CNAME]
module.local_certificate["timovink.app"].aws_route53_record.validation["*.timovink.app"]: Refreshing state... [id=Z090672659X2JIXVUFX0__898a605fd844d2311876cf17ced2654a.timovink.app._CNAME]
module.local_certificate["timovink.app"].aws_route53_record.validation["timovink.app"]: Refreshing state... [id=Z090672659X2JIXVUFX0__898a605fd844d2311876cf17ced2654a.timovink.app._CNAME]
module.global_certificate["timovink.com"].aws_acm_certificate_validation.this: Refreshing state... [id=2022-06-05 03:29:25.278 +0000 UTC]
module.global_certificate["jackievink.com"].aws_acm_certificate_validation.this: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.global_certificate["timovink.dev"].aws_acm_certificate_validation.this: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.global_certificate["timovink.app"].aws_acm_certificate_validation.this: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.global_certificate["timovink.ca"].aws_acm_certificate_validation.this: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.global_certificate["jackievink.ca"].aws_acm_certificate_validation.this: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.local_certificate["jackievink.com"].aws_acm_certificate_validation.this: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.local_certificate["jackievink.ca"].aws_acm_certificate_validation.this: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.local_certificate["timovink.app"].aws_acm_certificate_validation.this: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.local_certificate["timovink.com"].aws_acm_certificate_validation.this: Refreshing state... [id=2022-06-05 03:29:26.207 +0000 UTC]
module.local_certificate["timovink.dev"].aws_acm_certificate_validation.this: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.local_certificate["timovink.ca"].aws_acm_certificate_validation.this: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.domain_redirects["timovink.dev"].aws_cloudfront_distribution.this["timovink.app"]: Refreshing state... [id=EAY5X8SBN5IQF]
module.domain_redirects["timovink.dev"].aws_cloudfront_distribution.this["timovink.ca"]: Refreshing state... [id=E3PHIQXJMETTPU]
module.domain_redirects["jackievink.com"].aws_cloudfront_distribution.this["jackievink.ca"]: Refreshing state... [id=EWZR221LI6SAB]
module.domain_redirects["timovink.dev"].aws_cloudfront_distribution.this["timovink.com"]: Refreshing state... [id=E2D3O6B3HCBCCK]
module.domain_redirects["timovink.dev"].aws_route53_record.this["timovink.com"]: Refreshing state... [id=ZFMCDCUJ8UCFO_timovink.com_A]
module.domain_redirects["timovink.dev"].aws_route53_record.this["timovink.app"]: Refreshing state... [id=Z090672659X2JIXVUFX0_timovink.app_A]
module.domain_redirects["timovink.dev"].aws_route53_record.this["timovink.ca"]: Refreshing state... [id=Z08658091IB2VPYFZRTIS_timovink.ca_A]
module.domain_redirects["jackievink.com"].aws_route53_record.this["jackievink.ca"]: Refreshing state... [id=Z072293219D14M35KH4SZ_jackievink.ca_A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.dns["timovink.me"].aws_route53_zone.this will be created
  + resource "aws_route53_zone" "this" {
      + arn           = (known after apply)
      + comment       = "Managed by Terraform"
      + force_destroy = false
      + id            = (known after apply)
      + name          = "timovink.me"
      + name_servers  = (known after apply)
      + tags_all      = {
          + "Project" = "tv-sharedinfra"
        }
      + zone_id       = (known after apply)
    }

  # module.domain_redirects["timovink.dev"].aws_cloudfront_distribution.this["timovink.me"] will be created
  + resource "aws_cloudfront_distribution" "this" {
      + aliases                        = [
          + "timovink.me",
        ]
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + comment                        = "Redirect timovink.me to timovink.dev"
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = false
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_All"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags_all                       = {
          + "Project" = "tv-sharedinfra"
        }
      + trusted_key_groups             = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = false
          + default_ttl            = (known after apply)
          + max_ttl                = (known after apply)
          + min_ttl                = 0
          + target_origin_id       = "default"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = true
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "all"
                  + whitelisted_names = (known after apply)
                }
            }

          + function_association {
              + event_type   = "viewer-request"
              + function_arn = "arn:aws:cloudfront::920122847127:function/tv-sharedinfra-redirecttotimovinkdev"
            }
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "timovink.dev"
          + origin_id           = "default"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "match-viewer"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1.2",
                ]
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = (known after apply)
          + minimum_protocol_version = "TLSv1"
          + ssl_support_method       = "sni-only"
        }
    }

  # module.domain_redirects["timovink.dev"].aws_route53_record.this["timovink.me"] will be created
  + resource "aws_route53_record" "this" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "timovink.me"
      + type            = "A"
      + zone_id         = (known after apply)

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.global_certificate["timovink.me"].aws_acm_certificate.this will be created
  + resource "aws_acm_certificate" "this" {
      + arn                       = (known after apply)
      + domain_name               = "timovink.me"
      + domain_validation_options = [
          + {
              + domain_name           = "*.timovink.me"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "timovink.me"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.timovink.me",
          + "timovink.me",
        ]
      + tags_all                  = {
          + "Project" = "tv-sharedinfra"
        }
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.global_certificate["timovink.me"].aws_acm_certificate_validation.this will be created
  + resource "aws_acm_certificate_validation" "this" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.global_certificate["timovink.me"].aws_route53_record.validation["*.timovink.me"] will be created
  + resource "aws_route53_record" "validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # module.global_certificate["timovink.me"].aws_route53_record.validation["timovink.me"] will be created
  + resource "aws_route53_record" "validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # module.local_certificate["timovink.me"].aws_acm_certificate.this will be created
  + resource "aws_acm_certificate" "this" {
      + arn                       = (known after apply)
      + domain_name               = "timovink.me"
      + domain_validation_options = [
          + {
              + domain_name           = "*.timovink.me"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "timovink.me"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.timovink.me",
          + "timovink.me",
        ]
      + tags_all                  = {
          + "Project" = "tv-sharedinfra"
        }
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.local_certificate["timovink.me"].aws_acm_certificate_validation.this will be created
  + resource "aws_acm_certificate_validation" "this" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.local_certificate["timovink.me"].aws_route53_record.validation["*.timovink.me"] will be created
  + resource "aws_route53_record" "validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # module.local_certificate["timovink.me"].aws_route53_record.validation["timovink.me"] will be created
  + resource "aws_route53_record" "validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

Plan: 11 to add, 0 to change, 0 to destroy.
```

</details>